app/controllers/todos_controller.rb

INSERT INTO "todos" ("description", "completed", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "kk"], ["completed", 1], ["created_at", "2018-09-07 18:27:12.269580"], ["updated_at", "2018-09-07 18:27:12.269580"]]
---
	def create
		@todo = Todo.new(todo_params)
		@todo.save

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "todos" SET "completed" = ?, "updated_at" = ? WHERE "todos"."id" = ?  [["completed", 1], ["updated_at", "2018-09-10 02:41:53.112961"], ["id", 13]]
---
 	def complete
 		@todo = Todo.find(params[:id])
 		@todo.completed = true
 		@todo.save

SELECT "todos".* FROM "todos" WHERE "todos"."completed" = ?  [["completed", 0]]
---
 	def list
 		@todos = Todo.all
 		@completados = Todo.where(completed: true)